---
kind: type
id: T:Autodesk.Revit.DB.INavisworksExporter
source: html/b389017c-d7af-f0a4-7440-e9dc30f47718.htm
---
# Autodesk.Revit.DB.INavisworksExporter

The interface used to implement a Navisworks exporter.

## Syntax (C#)
```csharp
public interface INavisworksExporter : IExternalServer
```

## Remarks
Implement this interface and register an instance of the derived class with the Navisworks external service.